microresearch/allcolours/touch/software/stm32f4xx_it_2024_002.c
#include "stm32f4xx.h"
#include "stm32f4xx_dac.h"
#include "stm32f4xx_gpio.h"
#include "stm32f4xx_adc.h"
#include "stm32f4xx_dma.h"
#include "stm32f4xx_rcc.h"
#include "stm32f4xx_spi.h"
#include "stm32f4xx_tim.h"
#include <sys/unistd.h>
#include <errno.h>
#include <stdlib.h>
#include <sys/stat.h>
#include <sys/times.h>
#include "misc.h"
#include "resources.h"
#include "macros000.h"

#define TOPS 0b11111111111111110000000000000000
#define BOTS 0b00000000000000001111111111111111
#define TOP 4095

// timing is critical
// and maybe we need different BRK value for: mode, freezer, rec and play - 64 and 10 are close...
#define BRKF 8 // for freezer. 8 with 24 divider ////now 48 with divider of 8; was 8 when we have have divider in main as 32... too high causes issues for speed of freezes
#define BRK 8 // 8 is for when we have mode etc toggles outside main loop // was 128 // this is for mode and other toggles...
#define DELB 42 // 40 now with 8 divider - was 20 reduced was 200 delay for pin changes in new trigger code - was 10000 but this slows down all playback so we have to reduce and rely on BRK -- is delay we hold the the freeze/toggle
#define DELA 32 // for clear DAC // was 64

#define FULLRESET 1200 // say 6 seconds
#define SOFTRESET 800 // soft - over 4 seconds
#define SHORTMODE 8 // was 20ms could be shorter...
#define LONGMODE 280 // 2 sec
#define LONGTOG 300 // 1-2 secs long press for TOGGLE->activate
//#define PLAYFULLY 24 // length of playlist in fingers.h
#define LODGEFUL 27 // 0-27 = 28 lodges
#define THRESH 2048 // threshold for masking etc...

#ifdef fouronethree
#define MAXREC 8400 // was 9000/ prev 9500 // F413===depends on RAM! // for uint32_t we have this for 128Kb -> 320k around 10k samples which is how long??? // was 7000 like 30 seconds at 32 divider...
#else
#define MAXREC 3800 // for older STM
#endif
// with F413 we have 9200 which is how long - around 20 seconds now on 24 divider

#define LOWVAL 40 // lowest value to trigger recordings

//#define MAXMODES 8

uint32_t MAXMODE[4]={8,8,8,8};

GPIO_InitTypeDef GPIO_InitStructure;
extern __IO uint32_t adc_buffer[8];

static uint32_t recordings[8][MAXREC+1]={0}; // 
static int32_t real[8], reall[8];//, realfr[8]={0,0,0,0, 0,0,0,0}; // not static????
static int32_t control[4];
static uint32_t values[8]={0,0,0,0, 0,0,0,0}; // changed 2/10 NOW STATIC!
const uint32_t whichctrl[8]={0,1,2,3,0,1,2,3}; // ref for newADC speeds
const float *playreff[4]={logfast, logslow, logfast_stop, logslow_stop}; 
static uint32_t Theldon[8]={0,0,0,0, 0,0,0,0};

#include "fingers.h"

void send_command(int command, void *message)
{
   asm("mov r0, %[cmd];"
       "mov r1, %[msg];"
       "bkpt #0xAB"
         :
         : [cmd] "r" (command), [msg] "r" (message)
         : "r0", "r1", "memory");
}

char buffx[10];

void NMI_Handler(void)
{
}

void HardFault_Handler(void)
{
  while (1)
  {
  }
}

void MemManage_Handler(void)
{
  while (1)
  {
  }
}

void BusFault_Handler(void)
{
  while (1)
  {
  }
}

void UsageFault_Handler(void)
{
  while (1)
  {
  }
}

void SVC_Handler(void)
{
}

void DebugMon_Handler(void)
{
}

void PendSV_Handler(void)
{
}

#define delay()						 do {	\
    register unsigned int ix;					\
    for (ix = 0; ix < DELB; ++ix)				\
      __asm__ __volatile__ ("nop\n\t":::"memory");		\
  } while (0)

#define delay2()						 do {	\
    register unsigned int ix;					\
    for (ix = 0; ix < DELA; ++ix)				\
      __asm__ __volatile__ ("nop\n\t":::"memory");		\
  } while (0)


#define delayy()						 do {	\
    register unsigned int ix;					\
    for (ix = 0; ix < 10000000; ++ix)				\
      __asm__ __volatile__ ("nop\n\t":::"memory");		\
  } while (0)


inline static uint32_t overlayl(uint32_t value, uint32_t value2, uint32_t over){ // 4 bits - value is real, value2 is added // overlay on playback
  uint32_t tmpp;
  int32_t subs; float nn;
 	    if (over==0){ //usual - now swopped for >
	      if (value>value2) tmpp=value; // only if is more than
	      else tmpp=value2;
	    }
	    else if (over==1){ 
	      tmpp=value2+value;
	      if (tmpp>TOP) tmpp=TOP; 
	    }
	    else if (over==2){ // mod
	      tmpp=value2+value;
	      tmpp=tmpp%4096;
	    }
	    else { // subtract live and do abs...
	      subs=value2-value;
	      tmpp=abs(subs);
	    }
	    return tmpp;
}

// for CTRL and/or CTRL layer
inline static uint32_t overlay(uint32_t ctrl, uint32_t value, uint32_t over){ // 4 bits - value is real, value2 is added 
  uint32_t tmpp;
  int32_t subs; float nn;
 	    if (over==0){ //usual - now swopped for >
	      if (value>ctrl) tmpp=value; // only if is more than
	      else tmpp=ctrl;
	    }
	    else if (over==1){ 
	      tmpp=ctrl+value;
	      if (tmpp>TOP) tmpp=TOP; // as we store full value...
	    }
	    else if (over==2){ // mod
	      tmpp=ctrl+value;
	      tmpp=tmpp%4096;
	    }
	    else if (over==3){ // subtract live and do abs...
	      subs=value-ctrl;
	      tmpp=abs(subs);
	    }
	    else if (over==4){	    //add VCA/float thing /// but need more bits and more options
	    nn=ctrl/4095.0;
	    nn*=(float)value;
	    tmpp=(uint32_t)nn;
	    }
	    else if (over==5){	    //add VCA/float thing /// but need more bits and more options -> 3 bits=8 options...  +2 - mask/threshold!?
	      ctrl=4095-ctrl;
	      nn=ctrl/4095.0;
	      nn*=(float)value;
	      tmpp=(uint32_t)nn;
	    }
	    else if (over==6){ // 	      //	      - mask/threshold
	      if (ctrl>THRESH) tmpp=value;
		else tmpp=0;
	    }
	    else { 	      //	      - invert/threshold
	      if (ctrl>THRESH) tmpp=4095-value;
	    }
	    return tmpp;
}

inline static uint32_t overlayRP(uint32_t ctrl, uint32_t value, uint32_t over){ // 4 bits - value is real, value2 is added 
  uint32_t tmpp;
  int32_t subs; float nn;
 	    if (over==1){ //usual - now swopped for >
	      if (value>ctrl) tmpp=value; // only if is more than
	      else tmpp=ctrl;
	    }
	    else if (over==0){ 
	      tmpp=ctrl+value;
	      if (tmpp>TOP) tmpp=TOP; // as we store full value...
	    }
	    else if (over==2){ // mod
	      tmpp=ctrl+value;
	      tmpp=tmpp%4096;
	    }
	    else if (over==3){ // subtract live and do abs...
	      subs=value-ctrl;
	      tmpp=abs(subs);
	    }
	    else if (over==4){	    //add VCA/float thing /// but need more bits and more options
	    nn=ctrl/4095.0;
	    nn*=(float)value;
	    tmpp=(uint32_t)nn;
	    }
	    else if (over==5){	    //add VCA/float thing /// but need more bits and more options -> 3 bits=8 options...  +2 - mask/threshold!?
	      ctrl=4095-ctrl;
	      nn=ctrl/4095.0;
	      nn*=(float)value;
	      tmpp=(uint32_t)nn;
	    }
	    else if (over==6){ // 	      //	      - mask/threshold
	      if (ctrl>THRESH) tmpp=value;
		else tmpp=0;
	    }
	    else { 	      //	      - invert/threshold
	      //	      if (ctrl>THRESH) tmpp=4095-value;
	      //SOLO
	      tmpp=ctrl;
	    }
	    return tmpp;
}


// - this one is not for ctrl and is our solo one
inline static uint32_t overlayx(uint32_t value, uint32_t value2, uint32_t over){ // 4 bits - value is new value // for reclodge and playlodge -> layers // add erase value=0
  uint32_t tmpp, subs;
 	    if (over==0){
	      tmpp=value;
	    }
	    else if (over==1){
   	      if (value>value2) tmpp=value; // only if is more than
	      else tmpp=value2;
	    }
	    else if (over==2){ 
	      tmpp=value2+value;
	      if (tmpp>TOP) tmpp=TOP;
	    }
	    else { // mod
	      tmpp=value2+value;
	      tmpp=tmpp%4096;
	    }
	    return tmpp;
}

inline static void resetx(uint32_t which){
  for (uint32_t y=0;y<MAXREC;y++){ 
    recordings[which][y]=0;
  }
}

inline static void changemode(uint32_t dacc){
  f[dacc].majormode[f[dacc].state]++;
  if (f[dacc].majormode[f[dacc].state]>MAXMODE[f[dacc].state]) f[dacc].majormode[f[dacc].state]=0;
  f[dacc].ttoggle=0;
  f[dacc].play=0;					
  f[dacc].rec=0;
  f[dacc].state=N; // NADA  
  // TODO: what else we need to reset here
}

void resett(uint32_t dacc){
  f[dacc].rl[0].ind=0;
  f[dacc].rl[1].ind=0;					
  f[dacc].ttoggle=0;
  f[dacc].state=N;
  f[dacc].active=1;
  f[dacc].masterL[0]=0;
  f[dacc].masterL[1]=0;
  f[dacc].minormode[0][0]=0;
  f[dacc].minormode[0][1]=0;
  f[dacc].minormode[0][2]=0;
  f[dacc].minormode[0][3]=0;  
  f[dacc].minormode[1][0]=0;
  f[dacc].minormode[1][1]=0;
  f[dacc].minormode[1][2]=0;
  f[dacc].minormode[1][3]=0;  
  f[dacc].majormode[0]=0;
  f[dacc].majormode[1]=0;
  f[dacc].majormode[2]=0;
  f[dacc].majormode[3]=0;  
  f[dacc].playspeed[0]=0;
  f[dacc].playspeed[1]=0;
  f[dacc].ttoggle=0;
  f[dacc].play=0;					
  f[dacc].rec=0;
  f[dacc].rl[0].num_lodges=0;
  f[dacc].rl[1].num_lodges=0;
  f[dacc].lastmode=0;
  f[dacc].sensi=0;
  f[dacc].entryp=0;
  f[dacc].entryd=0;
  f[dacc].entryr=0;
  f[dacc].entryrp=0;
  f[dacc].leavep=0;
  //  f[dacc].playlistm=0;
  //  f[dacc].playlistp=0;
  for (uint32_t x=0;x<8;x++){ 
    resetx(x);
  }
  // zero all lodges
  for (uint32_t y=0;y<MAXLODGE;y++){
    f[dacc].rl[0].lodges[y].sil=0;
    f[dacc].rl[1].lodges[y].sil=0;
    f[dacc].rl[0].lodges[y].over=0;
    f[dacc].rl[1].lodges[y].over=0;
    f[dacc].rl[0].lodges[y].cnt=0;
    f[dacc].rl[1].lodges[y].cnt=0;
    f[dacc].rl[0].lodges[y].realend=0;
    f[dacc].rl[1].lodges[y].realend=0;
    f[dacc].rl[0].lodges[y].end=0;
    f[dacc].rl[1].lodges[y].end=0;
    f[dacc].rl[0].lodges[y].linkage=0;
    f[dacc].rl[1].lodges[y].linkage=0;
    f[dacc].rl[0].lodges[y].start=0;
    f[dacc].rl[1].lodges[y].start=0;
    f[dacc].rl[0].lodges[y].delcnt=0;
    f[dacc].rl[1].lodges[y].delcnt=0;
    f[dacc].rl[0].lodges[y].delcntt=0.0;
    f[dacc].rl[1].lodges[y].delcntt=0.0;
    f[dacc].rl[0].lodges[y].delay=0;
    f[dacc].rl[1].lodges[y].delay=0;
    f[dacc].rl[0].lodges[y].flag=0;
    f[dacc].rl[1].lodges[y].flag=0;

    f[dacc].pl[0].lodges[y].over=0;
    f[dacc].pl[1].lodges[y].over=0;
    f[dacc].pl[0].lodges[y].cnt=0;
    f[dacc].pl[1].lodges[y].cnt=0;
    f[dacc].rl[0].lodges[y].realend=0;
    f[dacc].pl[1].lodges[y].realend=0;
    f[dacc].pl[0].lodges[y].end=0;
    f[dacc].pl[1].lodges[y].end=0;
    f[dacc].pl[0].lodges[y].linkage=0;
    f[dacc].pl[1].lodges[y].linkage=0;
    f[dacc].pl[0].lodges[y].start=0;
    f[dacc].pl[1].lodges[y].start=0;
    f[dacc].pl[0].lodges[y].delcnt=0;
    f[dacc].pl[1].lodges[y].delcnt=0;
    f[dacc].pl[0].lodges[y].delay=0;
    f[dacc].pl[1].lodges[y].delay=0;
  }
}

inline static void resets(uint32_t dacc){ // soft reset of both layers
  f[dacc].masterL[0]=0;
  f[dacc].masterL[1]=0;
  f[dacc].ttoggle=0;
  f[dacc].state=N; // NADA
  f[dacc].play=0;					
  f[dacc].rec=0;
  f[dacc].lastmode=0;
  f[dacc].entryp=0;
  f[dacc].entryr=0;
  f[dacc].entryrp=0;
  f[dacc].leavep=0;
  for (uint32_t x=0;x<8;x++){ 
    //  f[dacc].l[0].cnt[x]=0;
    //  f[dacc].l[1].cnt[x]=0;
  //  f[dacc].l[0].play_cnt[x]=0;
  //  f[dacc].l[1].play_cnt[x]=0;
  }
  // zero all lodges TODO: etc
}

inline static float mod0(float value, float start, float ending, float length, uint32_t d, uint32_t which, uint32_t layer, uint32_t full) 
{
  static uint32_t lengthed;
  lengthed=0;
  while (value > (ending-1)){ // wrapping
    value -= ending;
  }
  return value;
}

uint32_t playlodge(float speed1, float speed2, uint32_t d, uint32_t P_options){ // pass in the p/layers
  uint32_t x, y, tmpx, tmpxx, lay;
  uint32_t sample=0;
  // tape 0
  for (x=0;x<f[d].pl[f[d].masterL[1]].num_lodges;x++){
    if (f[d].pl[f[d].masterL[1]].lodges[x].delcntt>=f[d].pl[f[d].masterL[1]].lodges[x].offset && (f[d].pl[f[d].masterL[1]].lodges[x].delcntt<=(f[d].pl[f[d].masterL[1]].lodges[x].offset+f[d].pl[f[d].masterL[1]].lodges[x].realend-f[d].pl[f[d].masterL[1]].lodges[x].start))) {     
      tmpx=f[d].pl[f[d].masterL[1]].lodges[x].cntt+f[d].pl[f[d].masterL[1]].lodges[x].start;
      f[d].pl[f[d].masterL[1]].lodges[x].cntt+=speed1;

