microresearch/allcolours/touch/software/stm32f4xx_it_2024_002.c
void R_nothing_leave(uint32_t d){
  f[d].leaver=0;
}

void P_nothing_leave(uint32_t d){
  f[d].leavep=0;
}

void RP_nothing_leave(uint32_t d){
  f[d].leaverp=0;
}


//- basic RP mode: just write new values to existing lodges, playback existing lodges (do we check that there are)...*
uint32_t RP_basic(uint32_t d, uint32_t V_options, uint32_t P_options, uint32_t R_options, uint32_t RP_options){
  uint32_t pp, other, tmpp, tmp, tmpx, x;
  if (f[d].entryrp==0){
    f[d].leaverp=1;
    f[d].entryrp=1;
    f[d].leaverp=1;
    tmpx=f[d].rl[0].num_lodges-1; // lodge we just left - close this one... // R is masterL[0], P is masterL[1]
    f[d].rl[0].lodges[tmpx].end=f[d].rl[0].lodges[tmpx].realend;
    tmpx=f[d].rl[1].num_lodges-1; // lodge we just left - close this one... // R is masterL[0], P is masterL[1]
    f[d].rl[1].lodges[tmpx].end=f[d].rl[1].lodges[tmpx].realend;
    // copy in rec zones to play zones
    // copy in rec zones to play zones
    f[d].pl[0].num_lodges=f[d].rl[0].num_lodges;
    for (x=0;x<f[d].rl[0].num_lodges;x++){
      f[d].pl[0].lodges[x].delcntt=f[d].rl[0].lodges[x].delcntt;
      f[d].pl[0].lodges[x].offset=f[d].rl[0].lodges[x].offset;
      f[d].pl[0].lodges[x].delay=f[d].rl[0].lodges[x].delay;
      f[d].pl[0].lodges[x].start=f[d].rl[0].lodges[x].start;
      f[d].pl[0].lodges[x].realend=f[d].rl[0].lodges[x].realend;
      if (P_options&1){ // reset play to beginning
      f[d].pl[0].lodges[x].delcntt=0.0;
      f[d].pl[0].lodges[x].cntt=0;
    }
    }
      // copy other layer in
    f[d].pl[1].num_lodges=f[d].rl[1].num_lodges;
    for (x=0;x<f[d].rl[1].num_lodges;x++){
      f[d].pl[1].lodges[x].delcntt=f[d].rl[1].lodges[x].delcntt;
      f[d].pl[1].lodges[x].offset=f[d].rl[1].lodges[x].offset;
      f[d].pl[1].lodges[x].delay=f[d].rl[1].lodges[x].delay;
      f[d].pl[1].lodges[x].start=f[d].rl[1].lodges[x].start;
      f[d].pl[1].lodges[x].realend=f[d].rl[1].lodges[x].realend;
      if (P_options&1){ // reset play to beginning
      f[d].pl[1].lodges[x].delcntt=0.0;
      f[d].pl[1].lodges[x].cntt=0;
      }
    }    
  } // entryrp
  // play
  LAYERSWOPRP; // swop both layers TODO: as option just to swop one = 3 bits
  float speedy=playreff[f[d].playspeed[f[d].masterL[1]]][(control[whichctrl[d]]>>2)]; // speed from CTRL
  tmp=real[d];
  pp=playlodge(speedy, speedy, d, 0);
  tmp=overlayl(tmp, pp, (P_options>>2)&3); // overlay of live value!
  // record overlay on zones on both layers
  tmpp=control[whichctrl[d]]; // we use CTRL as speed
  reclodgeRP(f[d].rl, d, real[d], tmpp, RP_options); 
  return tmp;
}

// TODO: deal with both layers! TODO: overlay of second layer
uint32_t P_basic(uint32_t d, uint32_t V_options, uint32_t P_options){  // CTRL live is speed
  uint32_t pp, x, otherl;
  if (f[d].entryp==0){
    lastvalue[d]=0;
    f[d].entryp=1;
    f[d].leavep=1;
    // copy in rec zones to play zones
    f[d].pl[0].num_lodges=f[d].rl[0].num_lodges;
    for (x=0;x<f[d].rl[0].num_lodges;x++){
      f[d].pl[0].lodges[x].delcntt=f[d].rl[0].lodges[x].delcntt;
      f[d].pl[0].lodges[x].offset=f[d].rl[0].lodges[x].offset;
      f[d].pl[0].lodges[x].delay=f[d].rl[0].lodges[x].delay;
      f[d].pl[0].lodges[x].start=f[d].rl[0].lodges[x].start;
      f[d].pl[0].lodges[x].realend=f[d].rl[0].lodges[x].realend;
      if (P_options&1){ // reset play to beginning
      f[d].pl[0].lodges[x].delcntt=0.0;
      f[d].pl[0].lodges[x].cntt=0;
    }
    }
      // copy other layer in
    f[d].pl[1].num_lodges=f[d].rl[1].num_lodges;
    for (x=0;x<f[d].rl[1].num_lodges;x++){
      f[d].pl[1].lodges[x].delcntt=f[d].rl[1].lodges[x].delcntt;
      f[d].pl[1].lodges[x].offset=f[d].rl[1].lodges[x].offset;
      f[d].pl[1].lodges[x].delay=f[d].rl[1].lodges[x].delay;
      f[d].pl[1].lodges[x].start=f[d].rl[1].lodges[x].start;
      f[d].pl[1].lodges[x].realend=f[d].rl[1].lodges[x].realend;
      if (P_options&1){ // reset play to beginning
      f[d].pl[1].lodges[x].delcntt=0.0;
      f[d].pl[1].lodges[x].cntt=0;
      }
    }    
  }
  LAYERSWOP;
  float speedy=playreff[f[d].playspeed[f[d].masterL[1]]][(control[whichctrl[d]]>>2)]; // speed from CTRL
  uint32_t tmp=real[d];
  pp=playlodge(speedy, speedy, d, 0);
  tmp=overlayl(tmp, pp, (P_options>>2)&3); // overlay of live value!
  return tmp;
}

uint32_t N_basic(uint32_t d, uint32_t V_options){
  uint32_t tmp=real[d];
  DOFREEZE;
  return tmp;
}

uint32_t (*Nfunc[2])(uint32_t d, uint32_t V_options)={N_basic};
uint32_t (*Rfunc[4])(uint32_t d, uint32_t V_options, uint32_t R_options)={R_basic, R_addlodges, R_addlodges_nosilence, R_addlodges_silence};
uint32_t (*RPfunc[2])(uint32_t d, uint32_t V_options, uint32_t P_options, uint32_t R_options, uint32_t RP_options)={RP_basic};
uint32_t (*Pfunc[2])(uint32_t d, uint32_t V_options, uint32_t P_options)={P_basic};

 void (*Rfunc_leave[4])(uint32_t d)={R_nothing_leave, R_addlodges_leave, R_addlodges_leave, R_addlodges_leave_silence};
 void (*RPfunc_leave[2])(uint32_t d)={RP_nothing_leave};
 void (*Pfunc_leave[2])(uint32_t d)={P_nothing_leave};


// STARTY
void TIM2_IRQHandler(void) 
  {
    uint32_t speed=0;
    float spd=0.0; // for new accel tests
    static uint32_t d=0;
    uint32_t j,x,y, tmp, tmpp, tmpy, autre;
    uint32_t freezer[8]={1<<8, 1<<4, 1<<13, 1<< 15,  1<<9, 1<<12, 1<<14, 1<<4}; // 1st 4 are vca, last 4 are volts  
    static uint32_t modetoggle=0, newmode=0, count=0;
    static uint32_t lasttriggered[11]={0,0,0,0, 0,0,0,0, 0,0,0}, mbreaker=0, breaker[11]={0,0,0,0, 0,0,0,0, 0,0,0};
    static int32_t togrec=0, togplay=0, helder=0, heldon=0, modeheld=0, modechanged=1, first=0;
    static uint32_t Theld[8]={0,0,0,0, 0,0,0,0};
    static uint32_t Thelder[8]={0,0,0,0, 0,0,0,0};
    static uint32_t Newtog[8]={0,0,0,0, 0,0,0,0};      
    uint32_t V_options, R_options[2], P_options[2], RP_options;
    const uint32_t SENSESHIFTS[3]={0,1,2}; // just use first 2 for now
    const uint32_t SENSEOFFSETS[3]={102,560,1800}; // TODO - adjust maybe
    //    const uint32_t remode[4]={0,1,2,2}; // 2 arrays N, R and P/RP
	      
