microresearch/allcolours/touch/software/stm32f4xx_it_2024_002.c
    if (TIM_GetITStatus(TIM2, TIM_IT_Update) != RESET) 
    {
        TIM_ClearITPendingBit(TIM2, TIM_IT_Update);

	// micromode logic outside mode switches - but what if these depend on mode!?
	V_options=f[d].minormode[0][0]&1; // V: sens, sync/global-overlay= 3 bits - top [6] syncs to [4] to test
	R_options[0]=f[d].minormode[0][1]&63; // 6 bits  2bits overlay ctrl + 2 bits x2 for 2nd tape overlay options
	P_options[0]=f[d].minormode[0][2]&127; // P,RP: 11 speedarray, 11 live overlay + now zone overlay // 6 bits + reset option=7 bits // TODO: adjust
	R_options[1]=f[d].minormode[1][1]&63; // 6 bits  2bits overlay ctrl + 2 bits x2 for 2nd tape overlay options
	P_options[1]=f[d].minormode[1][2]&127; // P,RP: 11 speedarray, 11 live overlay + now zone overlay // 6 bits + reset option=7 bits // TODO: adjust
	
	RP_options=(f[d].minormode[0][3]&7); // RP: overlay of live onto rec layer 

	//	RP_options=3<<6; 
	
	f[d].sensi=V_options&1; // first bit - sensitivity is in macros
	f[d].playspeed[0]=(P_options[0]>>1)&3; // speedarray = 2 bits
	f[d].playspeed[1]=(P_options[1]>>1)&3; // speedarray = 2 bits
	// functions outside switch
	FREEZERS;
	REALADC;
	CTRL;

	// is the finger active = long freeze
	   if (Newtog[d]){
	     Newtog[d]=0;
	     if (Theld[d]>LONGTOG) {
	       Theld[d]=0;
	       f[d].active^=1; // t0ggle
	       f[d].ttoggle=0;
	     }
	   }
	   
	// togplay and togrec	   
	if (f[d].active){
	  if (togplay) f[d].play^=1;
	  if (togrec) f[d].rec^=1;

	  if (f[d].lastmode==1 && f[d].play==0) { // if we leave overlaid via. exit from play
	    f[d].state=N;
	    f[d].rec=0; // added
	}
	else {
	// logic of states now
	  if (f[d].rec && f[d].play){
	    if (f[d].rl[f[d].masterL[0]].num_lodges>0){ // if we have a zone recorded
	    f[d].state=RP;
	  }
	    else {
	      f[d].state=R; // nothing to play
	    }
	  }
	  else if (f[d].rec)	f[d].state=R;
	  else if (f[d].play && (f[d].rl[f[d].masterL[0]].num_lodges>0)) f[d].state=P;
	  else f[d].state=N;
	}
	f[d].lastmode=0;
	} // end of active
	
	  // do main mode/state work with switches within this
	////// TESTY - SET MODES for testing!

	f[d].majormode[N]=0;
	f[d].majormode[P]=0;
	f[d].majormode[R]=0; // R_basic, R_addlodges, R_addlodges_nosilence, R_addlodges_silence
	f[d].majormode[RP]=0;
	///////////////////////////////////////////////////////	
	// NADA: TODO: geomantic mode thing - could be only for all modes which are active
	if (f[d].state==N){ 
	  RESETFRN;
	  values[d]=(*Nfunc[f[d].majormode[N]])(d, V_options);
	} // end NADA
	else f[d].entryn=0;

	// PLAY: 
	if (f[d].state==P){
	  LAYERSWOP; 
	  values[d]=(*Pfunc[f[d].majormode[P]])(d, V_options, P_options[f[d].masterL[1]]);
	} // end PLAY
	else {
	  if (f[d].leavep){ 
	    (*Pfunc_leave[f[d].majormode[P]])(d);
	  }
	  f[d].entryp=0;
	}

	// REC: 
	if (f[d].state==R){
	  LAYERSWOPR;
	  values[d]=(*Rfunc[f[d].majormode[R]])(d, V_options, R_options[f[d].masterL[0]]);
	} // end REC
	else {
	  if (f[d].leaver){ 
	    (*Rfunc_leave[f[d].majormode[R]])(d);
	  }
	  f[d].entryr=0;
	}
	
	// REC+PLAY: ADC->speed/bounce/rec to other // freeze is swop // what does voltage do (overlay same tape minormodes here)
	if (f[d].state==RP){ 
	  //	  RESETFRRP;  /// ????
	  f[d].lastmode=1; // in this case!
	  values[d]=(*RPfunc[f[d].majormode[RP]])(d, V_options, P_options[f[d].masterL[1]], R_options[f[d].masterL[0]], RP_options);
	} //end RP
	else {
	  if (f[d].leaverp){ // we left P so add to our playlist - TODO: if any other majormodes add to playlist we need to add these in
	    (*RPfunc_leave[f[d].majormode[RP]])(d);
	  }
	  f[d].entryrp=0;
    }
	///////////////////////////////////////////////////////	
	// end of modes 
	WRITEDAC2;
	d++;
	if (d==8) {
	  d=0;
	  count++;
	  togplay=0; togrec=0; // here as then we set them for one round
	  TEST_TOGGLES;      // only place where toggles
	  // handle micromodes, resett, and  
	  // how - depends on active positions // states we deal with later - go up to 10 bits

	  if (newmode){
	    newmode=0;
	    breaker[10]=0;

	    if (modeheld>FULLRESET) { //reset all
	      modeheld=0;
	      resett(0);
	      resett(1);
	      resett(2);
	      resett(3);
	      resett(4);
	      resett(5);
	      resett(6);
	      resett(7);
	    }
	    else if (modeheld>SOFTRESET && modeheld<FULLRESET){
	      if (f[0].active) resets(0);
	      if (f[1].active) resets(1);
	      if (f[2].active) resets(2);
	      if (f[3].active) resets(3);
	      if (f[4].active) resets(4);
	      if (f[5].active) resets(5);
	      if (f[6].active) resets(6);
	      if (f[7].active) resets(7);
	    }
	else if (modeheld>LONGMODE && modeheld<SOFTRESET) { // increment major mode if active
	  modeheld=0;
	  if (f[0].active) changemode(0);
	  if (f[1].active) changemode(1);
	  if (f[2].active) changemode(2);
	  if (f[3].active) changemode(3);
	  if (f[4].active) changemode(4);
	  if (f[5].active) changemode(5);
	  if (f[6].active) changemode(6);
	  if (f[7].active) changemode(7);
	}	
	else if (modeheld<LONGMODE){ //inc minor mode 
	  modeheld=0;
	  // if state==0 inc just 0
	  // ==1 inc depends on masterL[0]
	  // ==2 inc // TODO: recheck these
	  if (f[0].active) {
	    if (f[0].state==0 || f[0].state==3 ) f[0].minormode[0][f[0].state]++;
	    else if (f[0].state==1) f[0].minormode[f[0].masterL[0]][f[0].state]++;
	    else if (f[0].state==2) f[0].minormode[f[0].masterL[1]][f[0].state]++;
	    }
	  if (f[1].active) {
	    if (f[1].state==0 || f[1].state==3 ) f[1].minormode[0][f[1].state]++;
	    else if (f[1].state==1) f[1].minormode[f[1].masterL[0]][f[1].state]++;
	    else if (f[1].state==2) f[1].minormode[f[1].masterL[1]][f[1].state]++;
	    }
	  if (f[2].active) {
	    if (f[2].state==0 || f[2].state==3 ) f[2].minormode[0][f[2].state]++;
	    else if (f[2].state==1) f[2].minormode[f[2].masterL[0]][f[2].state]++;
	    else if (f[2].state==2) f[2].minormode[f[2].masterL[1]][f[2].state]++;
	    }
	  if (f[3].active) {
	    if (f[3].state==0 || f[3].state==3 ) f[3].minormode[0][f[3].state]++;
	    else if (f[3].state==1) f[3].minormode[f[3].masterL[0]][f[3].state]++;
	    else if (f[3].state==2) f[3].minormode[f[3].masterL[1]][f[3].state]++;
	    }
	  if (f[4].active) {
	    if (f[4].state==0 || f[4].state==3 ) f[4].minormode[0][f[4].state]++;
	    else if (f[4].state==1) f[4].minormode[f[4].masterL[0]][f[4].state]++;
	    else if (f[4].state==2) f[4].minormode[f[4].masterL[1]][f[4].state]++;
	    }
	  if (f[5].active) {
	    if (f[5].state==0 || f[5].state==3 ) f[5].minormode[0][f[5].state]++;
	    else if (f[5].state==1) f[5].minormode[f[5].masterL[0]][f[5].state]++;
	    else if (f[5].state==2) f[5].minormode[f[5].masterL[1]][f[5].state]++;
	    }
	  if (f[6].active) {
	    if (f[6].state==0 || f[6].state==3 ) f[6].minormode[0][f[6].state]++;
	    else if (f[6].state==1) f[6].minormode[f[6].masterL[0]][f[6].state]++;
	    else if (f[6].state==2) f[6].minormode[f[6].masterL[1]][f[6].state]++;
	    }
	  if (f[7].active) {
	    if (f[7].state==0 || f[7].state==3 ) f[7].minormode[0][f[7].state]++;
	    else if (f[7].state==1) f[7].minormode[f[7].masterL[0]][f[7].state]++;
	    else if (f[7].state==2) f[7].minormode[f[7].masterL[1]][f[7].state]++;
	    }
	}

	} // newmode
	}
    }
  
}
